require('dotenv').config();
const mongoose = require('mongoose');
const Feu = require('./models/feu');

// 💜 Connexion à MongoDB
mongoose.connect(process.env.MONGO_URI, { useNewUrlParser: true, useUnifiedTopology: true })
    .then(() => console.log("✅ Connecté à MongoDB"))
    .catch(err => console.error("❌ Erreur de connexion :", err));
// 💜 Données complètes des autoroutes
const feux = [{
    "explication_generale": "تستعمل الإشارات الضوئية بهدف ضمان السلامة المرورية وتحسين سيولة الجولان.\n\nيمكن أن تأخذ الأضواء شكلين: أضواء دائرية أو في شكل أسهم.\n\nتنظم الأضواء الثلاثية حركة المرور بالمفترقات، فيما تنظم الأضواء الثنائية حركة المرور بمحطات الاستخلاص، وبممرات المترجلين، وبتقاطع الطرقات مع السكة الحديدية.",
    "paragraphes": [
      {
      "description": "تكون الأضواء ذات نظام بثلاثة ألوان دائرية وتعني مايلي :\n\nالضوء الأحمر = قف\n- ممنوع تجاوز خط التوقف.\n- وفي حالة عدم وجود هذا الخط يعني ممنوع تجاوز العلامة ذاتها."
    },
    
      
      {
        "description": "• الضوء البرتقالي الثابت = قف\n- عند خط التوقف\n- عند العلامة نفسها (في صورة عدم وجود خط توقف)\n\n⚠️ هام:\nإذا كان السائق قريبًا من هذا الضوء بكيفية لا تمكنه من التوقف في ظروف سلامة كافية، فيمكنه مواصلة السير بشرط عدم وضع بقية مستعملي الطريق في خطر."
      },
    {"description":"• الضوء الأخضر : يعني السماح بتجاوز العلامة."},
      
      {
        "description": "\n\nتذكير\n- في كل الإشارات الضوئية يجب فسح مجال المرور لكل العربات والمترجلين الذين توغلوا في المفترق.\n- تجنب في كل الأحوال عرقلة الجولان بالمفترق.\n\nتوضع الأضواء حسب الطريقة التالية :\n1. الضوء البرتقالي : يظهر بعد الضوء الأخضر.\n2. الضوء الأحمر : يظهر بعد الضوء البرتقالي.\n3. الضوء الأخضر: يظهر بعد الضوء الأحمر.\n\nالاشارات الثنائية\nتنظم الأضواء الثنائية حركة الجولان بالسبل.\n\n• الأضواء الخاصة بمحطات الإستخلاص\n- الضوء الأحمر في شكل قاطع ومقطوع يوضح السبيل الممنوع.\n- أما الضوء الأخضر في شكل سهم موجه إلى الأسفل يوضح السبيل المسموح به."
      },
      
      
      {"description":"\n\nالأضواء الخاصة بالمترجلين\nتكون الإشارات الضوئية الخاصة بسير المترجلين ذات لونين.\nتعني هذه الإشارات مايلي"},
      {
        "description": "الأضواء في شكل أسهم\n\nيمكن تعويض الضوء الأحمر والضوء البرتقالي الثابت والضوء الأخضر بسهم أو عدة أسهم ذات لون أحمر أو برتقالي أو أخضر، هذه الأسهم لها نفس المعنى ولكن المنع أو السماح لا يخص إلا الاتجاهات المشار إليها بالأسهم."
      },
      {"description":"عند وجود ضوء أو عدة أضواء إضافية في شكل أسهم أو عدة أسهم خضراء مضاءة في نفس الوقت مع الضوء الأحمر أو الضوء البرتقالي، فإن هذه الأسهم تعني السماح بمواصلة السير فقط في الاتجاهات المشار إليها بالسهم بشرط فسح المرور للسواق القادمين بصفة عادية من اتجاهات أخرى والمترجلين.\n\nالأضواء الرفافة\n\n•"},
      {
        "description":"الضوء البرتقالي الرفاف : يعني السماح بتجاوز العلامة مع مضاعفة الانتباه ولا يغير قواعد الأولوية.\n\nويمكن أن يتعلق ب :\n- ضوء موضوع بصفة منفردة أو ضوئيين يشتغلان بالتداول.\n- ضوء تابع لنظام ذي ثلاثة ألوان إذا كان هذا النظام لا يشتغل."
      },
      {
        "description": "• ضوءان أحمران رفافان يشتغلان بالتداول وموضوعان بتقاطع الطرقات مع السكك الحديدية.\n\nهام\n=> تفقد الإشارات الضوئية مفعولها إذا كانت حركة الجولان منظمة من قبل عون المرور.\n=> إذا كانت الإشارات الضوئية لا تشتغل إلا بواسطة الضوء البرتقالي الرفاف، يجب الامتثال لبقية العلامات.\n=> إذا كانت الإشارات الضوئية لا تشتغل وليس هناك علامات ==> تكون الأولوية إلى اليمين."
      }
      
    ],
    "images":
    [
        "assets/img_203.png",
        "assets/img_204.png",
        "assets/img_205.png",
        "assets/img_206.png",
        "assets/img_207.png",
        "assets/img_208.png",
        "assets/img_209.png",
        "assets/img_210.png"
        
    
    ]
}];



Feu.insertMany(feux)
    .then(() => {
        console.log("✅ Insertion réussie !");
        mongoose.connection.close();
    })
    .catch(err => {
        console.error("❌ Erreur d'insertion :", err);
        mongoose.connection.close();
    });


async function insertfeu() {
    try {
        await Feu.deleteMany();
        await Feu.insertMany(feux);
        console.log("✅ Tous les croisements ont été insérés avec succès !");
        mongoose.connection.close();
    } catch (error) {
        console.error("❌ Erreur lors de l’insertion :", error);
    }
}

insertfeu();