require('dotenv').config();
const mongoose = require('mongoose');
const Light = require('./models/light');

// 💜 Connexion à MongoDB
mongoose.connect(process.env.MONGO_URI, { useNewUrlParser: true, useUnifiedTopology: true })
    .then(() => console.log("✅ Connecté à MongoDB"))
    .catch(err => console.error("❌ Erreur de connexion :", err));
// 💜 Données complètes des autoroutes
const lights = [{
    "explication_generale": "الهدف من هذا الباب هو تمكينك من معرفة الأضواء القانونية التي يجب أن تجهز بها العربات وكيفية استعمالها حسب المكان والظروف. يجب على كل سائق في الليل وكلما اقتضت ظروف الرؤية نهارا أن يستعمل الأضواء المتعلقة بتجهيز وتهيئة العربات",
    "paragraphes": [{
            "description": "أضواء الوضعية : عددها اثنان من الأمام ذات لون أبيض واثنان من الخلف ذات لون أحمر. تمكن من رؤية العربة عندما يكون الطقس صافٍ على مسافة 150 متر.\n\nتستعمل هذه الأضواء عند التوقف والوقوف ليلاً خارج مواطن العمران، أو عند التوقف والوقوف ليلاً داخل مواطن العمران في حالة عدم وجود إنارة عمومية"
        },
        {
            "description": "أضواء المقاطعة : عددها اثنان فقط ذات لون أبيض يرسلان إلى الأمام عند تشغيلها نوراً أبيض يضيء على مسافة 30 متر.\n\nتستعمل هذه الأضواء في الحالات التالية :\n\n- في بداية الليل بصفة عامة يجب استعمال أضواء التقاطع وذلك عندما تكون الرؤية محدودة.\n- عند التلاقي إذا كان استعمال ضوء الطريق يبهر السائق القادم من الاتجاه المعاكس.\n- عند السير وراء عربة أخرى إذا كان استعمال ضوء الطريق يبهر سائق هذه الأخيرة إلا أثناء المجاوزة.\n- إذا كانت إنارة الطريق مسترسلة وتسمح بالرؤية على مسافة كافية.\n- في الطرقات الجبلية الضيقة والتي بها عدة منعرجات متتالية.\n\nهام :\nعدم استعمال الأضواء أثناء السياقة بالليل ينجر عنه ارتكاب مخالفة خطيرة حسب مجلة الطرقات"
        },
        {
            "description": "أضواء الطريق : عددها اثنان ترسلان إلى الأمام عند تشغيلها نوراً أبيض يضيء الطريق بصفة ناجعة ليلاً عندما يكون الطقس صافٍ على مسافة 100 متر على الأقل.\n\nتستعمل هذه الأضواء في الحالات التالية :\n\n- عند الجولان ليلاً في طريق غير مضاءة (يجب الانتقال إلى أضواء التقاطع عند مقاطعة سائق عربة أخرى حتى لا يتعرض للإبهار).\n- ليلاً أثناء المجاوزة على مستوى العربة التي أقوم بمجاوزتها.\n\nهام :\n\n- عندما يبهر سائق عربة بقية مستعملي الطريق، يرتكب مخالفة خطيرة طبقاً للمقتضيات الواردة بمجلة الطرقات.\n- يسمح باستعمال المنبهات الصوتية في حالة الضرورة القصوى (توجيه الإنذارات الضرورية إلى مستعملي الطريق الآخرين).\n- يكون التنبيه بالإشارات الضوئية باستعمال أضواء الطريق أو المقاطعة بصفة متقطعة وقصيرة."
        },
        {
            "description": "أضواء الضباب : عددها اثنان  ترسلان إلى الأمام عند تشغيلها نورا أبيض أو أصفر .إذا كانت السيارة مجهزة بهذه الأضواء, فلا يمكن استعمالها إلا عند تقلص الرؤية بسبب : الضباب ،سقوط الثلوج، أمطار غزير"
        }
    ],
    "images":
    [
         "assets/img_217.png",
          "assets/img_218.png",
           "assets/img_219.png",
            "assets/img_220.png"
    ]         
}];



Light.insertMany(lights)
    .then(() => {
        console.log("✅ Insertion réussie !");
        mongoose.connection.close();
    })
    .catch(err => {
        console.error("❌ Erreur d'insertion :", err);
        mongoose.connection.close();
    });


async function insertlight() {
    try {
        await Light.deleteMany();
        await Light.insertMany(lights);
        console.log("✅ Tout les paragraphes ont été insérés avec succès !");
        mongoose.connection.close();
    } catch (error) {
        console.error("❌ Erreur lors de l’insertion :", error);
    }
}

insertlight();