require('dotenv').config();
const mongoose = require('mongoose');
const Arretstat = require('./models/arretstat');

// 💜 Connexion à MongoDB
mongoose.connect(process.env.MONGO_URI, { useNewUrlParser: true, useUnifiedTopology: true })
    .then(() => console.log("✅ Connecté à MongoDB"))
    .catch(err => console.error("❌ Erreur de connexion :", err));
// 💜 Données complètes des autoroutes
const arretstats = [{
    "explication_generale": "الهدف من هذا الباب :\n\n- تمكينك من التمييز بين الوقوف والتوقف.\n- التعرف على الأماكن التي يمكنك الوقوف والتوقف بها داخل مواطن العمران وخارجها.\n- في طريق ذات اتجاهين أو ذات اتجاه واحد.\n\nوسوف تتعرف كذلك على الأماكن التي يحجر الوقوف والتوقف بها",
    "paragraphes": [{
        "description": "التوقف هو وقوف عربة بالطريق بصورة مؤقتة لصعود أشخاص أو نزولهم أو لشحن بضائع أو تفريغها وعلى السائق أن يبقى بمقود العربة أو على مقربة منها لتحويلها عند الاقتضاء.\n\nأما الوقوف فهو مكوث عربة بالطريق مع إيقاف المحرك لأسباب غير التي تميز التوقف.\n\nيجب أن لا يشكل توقف أو وقوف أي عربة بالطريق أو توابعه خطرا على مستعملي الطريق وأن لا يتسبب في تعطيل حركة المرور وأن لا يحول دون الدخول إلى الأملاك المجاورة.\n\nويحجر الوقوف المفرط والوقوف أو التوقف الخطير أو المضايق.\n\nيعتبر وقوفا مفرطا كل وقوف بصفة مستمرة وبنفس المكان على الطريق لمدة تتجاوز 7 أيام.\n\nالوقوف والتوقف داخل مواطن العمران\n\nيجب أن يتم وقوف أي عربة داخل مواطن العمران حسب القواعد التالية :\n- قرب الرصيف وعلى مسافة لاتزيد عن 30 صم\n- في نفس اتجاه حركة الجولان\n- على الجهة اليمنى من الطريق ذات الاتجاهين\n- على الجهة اليمنى أو اليسرى من الطريق ذات الاتجاه الواحد ما عدى الحالات التي تتخذ فيها السلطات ذات النظر إجراءات مخالفة.\n\nالوقوف والتوقف خارج مواطن العمران\n\nيجب أن يتم توقف أو وقوف أي عربة خارج مواطن العمران على الحاشية :\n- إذا كانت الحاشية غير مستعملة لسير المترجلين أو مهيأة لبعض أصناف مستعملي الطريق\n- إذا كان عرض الحاشية كاف ويسمح بتوقف أو وقوف العربات."
      },
      
      {
        "description": "عرض هذه الحاشية كاف و يسمح بالوقوف و التوقف\n\nالتمييز بين العلامات : منع الوقوف والتوقف\n\nتمنع هذه العلامة الوقوف والتوقف بداية منها وإلى حدود المفترق القادم."
      },
      
        {
            "description": " تبين هذه الصورة خط أصفر اللون متواصل يكمل أو يعوض العلامة السابقة. "
        },
        {
            "description": "تمكنني هذه العلامة من التوقف وتحجر  الوقوف إلى حدود المفترق القادم . "
        },
        {
            "description": "تبين هذه الصورة خط أصفر اللون متواصل يكمل أو يعوض العلامة السابقة."
        },
        {
            "description": "التوقف او الوقوف الخطير\n\nيحجر التوقف أو الوقوف الخطير\n\nويعتبر التوقف أو الوقوف خطيرا بالأماكن التي تكون فيها الرؤية محدودة وخاصة ب :\n- المفترقات وبالقرب منها على مسافة تقل عن 10 متر خارج مواطن العمران و3 متر داخلها,\n- بقمم المرتفعات والمنعرجات إذا كانت الرؤية غير مضمونة على مسافة 50 م على الأقل في الاتجاهين,\n- على الممرات العليا والجسور وتحتها وبالأنفاق,\n- عند تقاطع الطرقات مع السكك الحديدية وبالقرب منها على مسافة تقل عن 30 متر خارج مواطن العمران وعن 10 متر داخلها.\n\nالتوقف أو الوقوف المضايق\n\nيحجر التوقف أو الوقوف المضايق ويعتبر التوقف أو الوقوف مضايقا في الحالات التالية :\n- على الأرصفة,\n- على الممرات الخاصة بالمترجلين وبالقرب منها على مسافة تقل عن 3 متر إن كانت موجودة بالمفترق,\n- على الممرات الخاصة ببعض أصناف مستعملي الطريق,\n- بالأماكن المخصصة لوقوف بعض أصناف مستعملي الطريق,\n- بالممرات والسبل والمحطات المخصصة لعربات النقل العمومي للأشخاص,\n- بقرب أو بجانب علامات الطريق إذا كانت العربة تحجب رؤية هذه العلامات على بقية مستعملي الطريق,\n- ما بين حافة المعبد وخط متواصل عندما يكون عرض الجزء الشاغر من المعبد ما بين الخط والعربة لا يسمح بمرور عربة أخرى دون السير على الخط أو اجتيازه,\n- على الجهة اليسرى للمعبد ذي الاتجاه الواحد إذا كان الجزء الشاغر من المعبد في صورة وقوف عربات على الجهتين دون 3 متر."
          },
          
          {
            "description": "يحجر الوقوف أو التوقف في الصف الثاني على المعبد لأنه يضايق بقية مستعملي الطريق.\n\nيعتبر وقوف العربات مضايقا أيضا :\n- قرب أماكن الأشغال,\n- في الصف الثاني على المعبد,\n- أمام مداخل الممتلكات و المستودعات و المآوي المهيئة لدخول أو خروج العربات,\n- على أقل من 20 م من ممر المترجلين إذا كان هذا الأخير لا يوجد على مستوى المفترقات.\n\nيخضع الوقوف لقواعد خاصة:\n\nالوقوف في المناطق الزرقاء:\nتنظم قواعد الوقوف في هذه المناطق من طرف السلط البلدية الراجعة لها بالنظر.\n\nالوقوف بمقابل:\nعندما يكون الوقوف بمقابل يقع تنبيه السائق بعبارة بمقابل."
          }
    ],
    "images":
    [
        "assets/img_211.png",
        "assets/img_212.png",
        "assets/img_213.png",
        "assets/img_214.png",
        "assets/img_215.png",
        "assets/img_216.png"
    ]
}];



Arretstat.insertMany(arretstats)

    .then(() => {
        console.log("✅ Insertion réussie !");
        mongoose.connection.close();
    })
    .catch(err => {
        console.error("❌ Erreur d'insertion :", err);
        mongoose.connection.close();
    });


async function insertarretstat() {
    try {
        await Arretstat.deleteMany();
        await Arretstat.insertMany(arretstats);
        console.log("✅ Tous les croisements ont été insérés avec succès !");
        mongoose.connection.close();
    } catch (error) {
        console.error("❌ Erreur lors de l’insertion :", error);
    }
}

insertarretstat();