require('dotenv').config();
const mongoose = require('mongoose');
const Priorite = require('./models/priorite');

// 💜 Connexion à MongoDB
mongoose.connect(process.env.MONGO_URI, { useNewUrlParser: true, useUnifiedTopology: true })
    .then(() => console.log("✅ Connecté à MongoDB"))
    .catch(err => console.error("❌ Erreur de connexion :", err));
// 💜 Données complètes des autoroutes
const priorites = [{
    "explication_generale": "يهدف هذا الباب إلى التعريف بقواعد الأولوية وذلك :\n\n بالمفترقات بعلامات أو بدون علامات\n بالمفترقات المجهزة بأضواء\n بمفترق الطرقات ذات الاتجاه الدوراني",
    "paragraphes": [{
            "description": "عند الاقتراب من تقاطع طرقات، يجب على السائق:\n\n1. أن يخفض من سرعته.\n2. أن يتحقق من أن المعبد الذي ينوي قطعه شاغر.\n3. أن ينبه باقترابه بواسطة الإشارات اللازمة.\n4. أن يحترم القواعد المتعلقة بالأولوية.\n\nتقاطع طرقات بدون علامات:\n\nعند هذه المفترقات تطبق قاعدة الأولوية لليمين.\n\nبهذا المفترق بدون علامات، يجب أن أفسح مجال المرور للعربة القادمة من اليمين."
        },
        {"description":"علامات الأولوية:"},
        {
            "description": "\n\nتعلن هذه العلامة عن الاقتراب من مفترق طرقات أين يجب ترك الأولوية للعربات القادمة من اليمين.\n\nفسح المجال بالمفترق:"
          },
          {
            "description": "\n\nعند وجود هذه العلامة يجب فسح المجال إلى اليسار واليمين. يكون التوقف غير إجباري إذا كان المعبد شاغرا.\n\nعلامة قف:"
          },
          
        {
            "description": "\n\nالتوقف إجباري عند حد المعبد حتى لو كانت الطريق شاغرة. إذن أفسح مجال المرور إلى اليمين واليسار.\n\nوفي حالة وجود خط عرضي متواصل أبيض، يجب التوقف عند مستوى هذا الخط."
        },
        {
            "description": "تبين هذه العلامة أنه سوف تعترضني علامة قف على بعد 150 مترًا.\n\nطريق ذات أولوية."
          },
          {"description":"إضافة:"},
          
        {
            "description": "يمكن أن تكمل علامة طريق ذات أولوية بلافتة تمثل رسمًا للمفترق القادم مع الإشارة بواسطة خط سميك لفروع المفترق الذي يتمتع بالأولوية.\n\nالفرع العمودي في أسفل اللافتة يمثل الطريق التي وضعت فيه العلامة."
        },
        {
            "description": "تشير هذه العلامة إلى أن الطريق الذي تم وضع العلامة فيه يتمتع بالأولوية، ولكن عند المفترق القادم فقط"
          },
       
        {
            "description": "تشير هذه العلامة إلى أن الطريق الذي تم وضع العلامة فيه يتمتع بالأولوية، ولكن عند المفترق القادم فقط.\n\n**القواعد الخاصة بمفترق طرقات ذي اتجاه دوراني:**\nيوجد نوعان من مفترق الطرقات ذات الشكل الدائري."
          },
          
          {
            "description": "مفترق طرقات ذي اتجاه دوراني يحتوي على علامة عمودية متقدمة تلزم السائقين على فسح المجال للعربات الآتية من جهة اليسار.\n- مفترق طرقات بدون علامات تسري عليه قواعد الأولوية على اليمين.\n\n**تذكير:**\nعند التوغل في مفترق طرق دوراني يجب على سائق العربة:\n- المرور قريبًا من الأرض المسطحة المركزية بهذا المفترق للسير إلى اليسار أو للرجوع على الأعقاب.\n- الانحياز إلى اليمين للانعطاف إلى اليمين أو للسير إلى الأمام."
          },
          
          {
            "description": "**إشارات أعوان المرور:**\nيجب على مستعملي الطريق الامتثال لإشارات الأعوان المكلفين بتنظيم حركة المرور.\nتلغي إشارات هؤلاء الأعوان وتعوض المعلومات المبينة بواسطة علامات الطريق ورسوم الطريق وكذلك الأضواء.\n\n**الإشارات الضوئية:**\n- إذا كانت الإشارات الضوئية لا تشتغل إلا بواسطة الضوء البرتقالي الرفاف، فإنه يجب احترام العلامة الموجودة بعمود الأضواء.\n- في صورة عدم وجود علامات ==> تطبق الأولوية إلى اليمين.\n\nفي هذه الوضعية يشتغل الضوء البرتقالي الرفاف فقط، لذا يجب احترام علامة ترك الأولوية الموجودة بعمود الأضواء وفسح مجال المرور قبل الدوران إلى اليمين."
          },
          
        {
            "description": "هام:\n\nيجب فسح مجال المرور للعربات السائرة على المعبد:\n\n- عند الخروج من مسلك غير معبد أو مسلك ترابي.\n- عند الخروج من ملك مجاور.\n- عند الخروج من مأوى للوقوف.\n\nكما يجب فسح مجال المرور وذلك بإخلاء المعبد والوقوف عند الاقتضاء لتسهيل مرور العربات ذات الأولوية وذلك عند استعمالها للمنبهات الصوتية والضوئية."
        }

    ],
    "images":
    [

        "assets/img_192.png",
        "assets/img_193.png",
        
        "assets/img_194.png",
        "assets/img_195.png",
        
        "assets/img_196.png",
        "assets/img_197.png",
        
        "assets/img_198.png",
        "assets/img_199.png",
        
        "assets/img_200.png",
        "assets/img_201.png",
        
        "assets/img_202.png"
        
    ]
}];



Priorite.insertMany(priorites)
    .then(() => {
        console.log("✅ Insertion réussie !");
        mongoose.connection.close();
    })
    .catch(err => {
        console.error("❌ Erreur d'insertion :", err);
        mongoose.connection.close();
    });


async function insertpriorite() {
    try {
        await Priorite.deleteMany();
        await Priorite.insertMany(priorites);
        console.log("✅ Tout les paragraphes ont été insérés avec succès !");
        mongoose.connection.close();
    } catch (error) {
        console.error("❌ Erreur lors de l’insertion :", error);
    }
}

insertpriorite();